fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ВКМ_ВидДоговораПриИзмененииНаСервере()
	
	// Реквизиты договора Абонентское обслуживание
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ГруппаФормы = ЭтаФорма.Элементы.Добавить("ВКМ_ГруппаПериодДействияДоговора", Тип("ГруппаФормы"),ЭтаФорма);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Заголовок = "Период действия договора";
		ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		ГруппаФормы.ОтображатьЗаголовок = ИСТИНА; 
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаФормы.РастягиватьПоГоризонтали = ИСТИНА;
		
		ЭлементФормы = Элементы.Добавить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"),Элементы.ВКМ_ГруппаПериодДействияДоговора);	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора"; 
		ЭлементФормы.Заголовок = "с";
		
		ЭлементФормы = Элементы.Добавить("ВКМ_КонецДействияДоговора",Тип("ПолеФормы"),Элементы.ВКМ_ГруппаПериодДействияДоговора);	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";   
		ЭлементФормы.Заголовок = "по";
		
		ЭлементФормы = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"));	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";  
		
		ЭлементФормы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"));	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";  		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
